{
  "title": "Los límites de un tópico",
  "ideas": [
    {
      "heading": "Introducción",
      "subideas": [
        {
          "content": "Cuando Dios pone temor por Su Palabra en la mente del escogido, ocurren tanto cosas maravillosas como nuevos riesgos."
        }
      ]
    },
    {
      "heading": "Un mandamiento aparentemente evidente",
      "subideas": [
        {
          "content": "¿Cómo interpretarías este mandamiento?:"
        },
        {
          "content": "Guardarás el día de reposo para santificarlo, como el Señor tu Dios lo ha mandado. Seis días trabajarás y harás todo tu trabajo, mas el séptimo día es día de reposo para el Señor tu Dios. no harás en él ningún trabajo, tú, ni tu hijo, ni tu hija, ni tu siervo, ni tu sierva, ni tu buey, ni tu asno, ni ninguno de tus animales, ni el extranjero que está contigo, para que tu siervo y tu sierva también descansen como tú.",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": [
            "Deuteronomio 5:12-14"
          ]
        },
        {
          "content": "A primera vista, parece que el mandamiento prohibe todo lo que no sea \"reposo\", ¿cierto?"
        },
        {
          "content": "Pareciera que toda actividad fuera de contemplar la obra de Dios queda excluída."
        },
        {
          "content": "Más aún, considera cómo interpretaríamos este mandamiento, sabiendo que el libro que lo contiene comienza diciendo:"
        },
        {
          "content": "...Ustedes no añadirán nada a la palabra que yo les mando, ni quitarán nada de ella, para que guarden los mandamientos del Señor Su Dios que yo les mando.",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": [
            "Deuteronomio 4:2"
          ]
        },
        {
          "content": "Junto con este princio, también tendríamos que considerar que la ley y la historia del Antiguo Testamento indican que todo el que transgrediera debía enfrentar la pena de muerte:"
        },
        {
          "content": "Seis días se trabajará, pero el séptimo día será para ustedes un día santo, día de completo reposo para el Señor. Cualquiera que haga trabajo alguno en él, morirá",
          "type": "biblical_quote",
          "quote_reference": [
            "Éxodo 35:2-3"
          ]
        },
        {
          "content": "Igualmente, considera cómo tomaríamos el mandamiento del sábado, si consideramos que Salomón, el filósofo más sabio de la historia, advirtió sobre la modificación de los pasajes bíblicos de esta manera:"
        },
        {
          "content": "Probada es toda palabra de Dios; Él es escudo para los que en Él se refugian. No añadas a Sus palabras, no sea que Él te reprendas y seas hallado mentiroso.",
          "type": "biblical_quote",
          "quote_reference": [
            "Proverbios 30:5-6"
          ]
        },
        {
          "content": "Más aún, cómo interpretaríamos este mandamiento, sabiendo que Jesús, nuestro Emperador eterno, nos advirtió con estas palabras:"
        },
        {
          "content": "... hasta que pasen el cielo y la tierra, no se perderá ni la letra más pequeña ni una tilde de la ley hasta que todo se cumpla... Cualquiera, pues, que anule uno solo de estos mandamientos, aun de los más pequeños, y así lo enseñe a otros, será llamado muy pequeño en el reino de los cielos.",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": [
            "Mateo 5:19-20"
          ]
        },
        {
          "content": "Pienso que tomando en cuenta estas consideraciones, tenderíamos a interpretar el mandamiento del sábado de la manera en que lo que hicieron los fariseos del tiempo de Cristo."
        },
        {
          "content": "Pienso que diríamos:"
        },
        {
          "content": "\"No debe hacerse ninguna actividad que no sea adorar y reposar de manera pasiva los sábados\".",
          "type": "soft_quote"
        }
      ]
    },
    {
      "heading": "¿Acaso es tan sencillo?",
      "subideas": [
        {
          "content": "Y no solo esto, igualmente pienso que pudiéramos concluir que incluso las actividades ministeriales enérgicas y llenas de desplazamiento serían inapropiadas."
        },
        {
          "content": "Parece sencillo, ¿cierto?"
        },
        {
          "content": "Si la totalidad del pueblo de Dios debía reposar el sábado, y si los mandamientos debían guardarse exactamente como se habían entregado, ¿quién pudiera insistir en que trabajar con ganado, dezplazarse entre ciudades, trabajar en el templo, o realizar intensas actividades ministeriales, eran obras lícitas para este día?"
        },
        {
          "content": "Tal vez no sea tu caso, pero puedo asegurarte este ha sido mi proceso de interpretación en un monton de ocasiones."
        },
        {
          "content": "Sin embargo, para mi sorpresa y tal vez para tu sorpresa igualmente, esta es una interpretación incorrecta."
        },
        {
          "content": "Sabemos que esta una interpretación incorrecta porque sabemos cómo Jesús, el Hijo de Dios que vivió perfectamente la Escritura no lo tomó de esta manera."
        },
        {
          "content": "Más abajo demostraré esto con contundencia."
        },
        {
          "content": "Pero antes, quisiera plantearte lo que entiendo es una de las causas por las que cometemos estos errores."
        },
        {
          "content": "Quisiera sugerir que desde el comienzo de estos comentarios, hemos estado planteando la pregunta incorrecta."
        }
      ]
    },
    {
      "heading": "La pregunta correcta",
      "subideas": [
        {
          "content": "La pregunta correcta no es ¿cómo interpretarías este mandamiento?"
        },
        {
          "content": "Esto solo llevará a un sin fin de discusiones sobre la interpretación de cada parte."
        },
        {
          "content": "La pregunta correcta es más bien ¿cómo interpretaría Dios su propia palabra?"
        },
        {
          "content": "Esta obviamente es la aproximación correcta, ¿cierto?"
        },
        {
          "content": "¿Qué mejor manera tendríamos para interpretar la obra de un autor que seguir su propio ejemplo de interpretación?"
        },
        {
          "content": "Imitar a Dios en la manera en la que Él mismo interpreta su palabra es la única forma de comprender verazmente su voluntad y escapar de las divisiones."
        }        
      ]
    },
    {
      "heading": "Una pregunta falible",
      "subideas": [
        {
          "content": "Sin embargo, aunque hagamos la pregunta correcta, esto no garantiza que sigamos la respuesta, o que igualmente comprendamos esta respuesta."
        },
        {
          "content": "Debemos recordar que somo pecadores, y que de una forma u otra, nuestra ignorancia y pecado hallará la forma de equivocarnos."
        },
        {
          "content": "Bajo estas nubes siempre lucharemos con el error y la ignorancia."
        },
        {
          "content": "Por consiguiente, necesitamos una collección de recursos para mitigar esta realidad lamentable."
        }      
      ]
    },
    {
      "heading": "Medios poderosos",
      "subideas": [
        {
          "content": "Afortunadamente, Dios se ha complacido en otorgarnos los recursos necesarios."
        },
        {
          "content": "Dios nos ha provisto todo lo que necesitamos para lidiar con nuestra pecaminosidad en la interpretación bíblica."
        },
        {
          "content": "Por una parte, Dios nos ha otorgado la obra de Jesucristo, que nos limpia de nuestros pecados de mala interpretación y práctica de las Escrituras."
        },
        {
          "content": "Por otra, el Espíritu Santo nos guía a la verdad que exalta a Cristo."
        }  ,
        {
          "content": "De igual manera, el Espíritu nos lleva a la humildad que doblega nuestros intereses egoístas que cierran nuestra mente al cambio que requieren las Escrituras."
        },
        {
          "content": "Y por último entre muchos otros, Jesucristo nos ha dado muchos buenos hermanos que nos han enseñado fielmente Su palabra durante los últimos 2000 años."
        },
        {
          "content": "En la medida que abracemos estos recursos humildemente, podremos mitigar nuestra pecaminosidad errante."
        }
      ]
    },
    {
      "heading": "Dios no es literalista",
      "subideas": [
        {
          "content": "Las Escrituras muestran con bastante precisión, la manera en que Jesús interpretó este mandamiento:"
        },
        {
          "content": "¿... no han leído lo que hizo David cuando él y sus compañeros tuvieron hambre, cómo entró en la casa de Dios y comieron los panes consagrados, que no les era lícito comer, ni a él ni a los que estaban con él, sino solo a los sacerdotes?",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": [
            "Mateo 12:4"
          ]
        },
        {
          "content": "¿O no han leído en la ley, que en los días de reposo los sacerdotes en el templo profanan el día de reposo y están sin culpa? Pues les digo que algo mayor que el templo está aquí",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": [
            "Mateo 12:5-6"
          ]
        },
        {
          "content": "Pero si ustedes hubieran sabido lo que esto significa: 'Misericordia quiero y no sacrificio', no hubieran condenado a los inocentes. Porque el Hijo del Hombre es Señor del día de reposo",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": [
            "Mateo 12:8"
          ]
        },
        {
          "content": "¿Qué hombre habrá de ustedes que tenga una sola oveja, si esta se le cae en un hoyo en el día de reposo, no le echa mano y la saca? Pues, ¡cuánto más vale un hombre que una oveja! Por tanto, es licito hacer bien en el día de reposo.",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": [
            "Mateo 11:11-12"
          ]
        },
        {
          "content": "Jesús interpretó el sábado de esta manera:"
        },
        {
          "content": "Mientras que llega el Mesías para cumplir la ley y establecer un nuevo pacto con nuevas regulaciones, solo harás aquellas obras necesarias por motivo de misericordia y por obligación de otras porciones de la ley.",
          "type": "biblically_justified_idea",
          "biblical_references": [
            "Gálatas 3",
            "Hebreos"
          ]
        },
        {
          "content": "Es decir:"
        },
        {
          "content": "Mientras que llega el Mesías, reposarás de toda obra, a menos que la integridad de una persona, criatura o posesión, esté en riesgo, o a menos que la ley te ordene quebrantarlo.",
          "type": "soft_quote"
        }
      ]
    },
    {
      "heading": "El peligro del literalismo minimalista",
      "subideas": [
        {
          "content": "Esta realidad evidencia la importancia de asumir los procedimientos correctos para interpretar la Escritura."
        },
        {
          "content": "Ciertamente es maravilloso abrazar el temor de Dios en relación a Su palabra. Es maravilloso comprometernos con el principio bíblico de evitar añadir y sustraer."
        },
        {
          "content": "Pero este compromiso involucra una serie de nuevas tentaciones."
        },
        {
          "content": "Cuando decidimos enseñar y vivir de manera exacta las Escrituras, tendemos a confundir la exactitud con el literalismo minimalista."
        },
        {
          "content": "El literalismo minimalista es la tendencia de entender los mandatos bíblicos de la manera más restrictiva posible que viene a nuestra mente cuando estudiamos la palabra."
        },
        {
          "content": "El literalismo es preferir la exactitud inmediata y restrictiva en lugar de la exactitud canónica."
        },
        {
          "content": "La exactitud canónica es la manera precisa de entender un tema o mandamiento bíblico, luego de asimilar todo lo que la Biblia enseña al respecto, e identificar a cúal de todas las aplicaciones del tema se está limitando la enseñanza en consideración."
        }
      ]
    }
  ]
}