{
  "title": "Los límites de un tópico",
  "ideas": [
    {
      "heading": "Jesús no era un literalista",
      "subideas": [
        {
          "content": "Cómo interpretarías este mandamiento:"
        },
        {
          "content": "... el séptimo día es día de reposo para el Señor tu Dios. No harás en él trabajo alguno, tú, ni tu hijo, ni tu hija, ni tu siervo, ni tu sierva, ni tu ganado, ni el extranjero que está contigo. porque en seis días hizo el Señor los cielos y la tierra, el mar y todo lo que en ellos hay, y reposó en el séptimo día. Por tanto, el Señor bendijo el día de reposo y lo santificó.",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": ["Deuteronomio 5:12-14"]
        },
        {
          "content":"A primera vista, parece que el mandamiento prohibe todo lo que no sea el reposo ¿cierto?"
        },
        {
          "content":"Más aún, ¿cómo interpretaríamos este mandamiento sabiendo que el libro comienza con esta instrucción?"
        },
        {
          "content": "...Ustedes no añadirán nada a la palabra que yo les mando, ni quitarán nada de ella, para que guarden los mandamientos del Señor Su Dios que yo les mando.",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": ["Deuteronomio 4:2"]
        },
        {
          "content":"Y mucho más aún, ¿cómo lo interpretaríamos si viéramos que Jesús dijo:?"
        },
        {
          "content": "... Cualquiera, pues, que anule uno solo de estos mandamientos, aun de los más pequeños, y así lo enseñe a otros, será llamado muy pequeño en el reino de los cielos... si su justicia no supera la de los escribas y fariseos, no entrarán en el reino de los cielos.",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": ["Mateo 5:19-20"]
        },
        {
          "content":"Pienso que naturalmente haríamos lo que hicieron los fariseos del tiempo de Cristo."
        },
        {
          "content":"Pienso que diríamos \"No debe hacerse ninguna actividad que no sea adorar y reposar los sábados\", e igualmente concluiríamos que todo el que trabaje intensamente en este día se opone a la voluntad divina."
        },
        {
          "content":"Sin embargo, cuando vemos cómo el Espíritu Santo y cómo el Señor Jesucristo, interpretaron este mandamiento, notarmos que el entendimiento adecuado era mucho más refinado:"
        },
        {
          "content": "¿Qué hombre habrá de ustedes que tenga una sola oveja, si esta se le cae en un hoyo en el día de reposo, no le echa mano y la saca? Pues, ¡cuánto más vale un hombre que una oveja! Por tanto, es licito hacer bien en el día de reposo.",
          "strong_phrases": [],
          "type": "biblical_quote",
          "biblical_references": [],
          "quote_reference": ["Mateo 12:11-12"]
        }
      ]
    }
  ]
}