{
  "title": "Code is the natural language",
  "ideas": [
    {
      "subideas": [
        {
          "content": "CODE IS THE NATURAL LANGUAGE. Nor English, nor Spanish, nor any other language is \"natural language\" for software development. Code is the natural language for this endeavor."
        }
        , 
        {
          "content": "If we define software development as problem solving by precise, testable, repeatable, and humanly reviewable, machine instructions, nothing is more natural than code."
        }
        , 
        {
          "content": "Code is defined, structured, succinct, beautiful, expressive, and testable."
        }        
        , 
        {
          "content": "Why would we step down to a combination of English and unmastered ai generated code?"
        }        
        , 
        {
          "content": "That's the reason why 70 years of software development lead to engineering marvels like C# or GO. This is the best way to solve problems with precision, observability, and reliable practices through software."
        }        
        , 
        {
          "content": "But let's move to another issue, preparing for the future..."
        }        
        , 
        {
          "content": "Why would we want to develop without code if we still need to master code reviewing to be responsible professionals?"
        }        
        , 
        {
          "content": "Would we say that AI generated code with no human review will power airplanes, financial systems, war machines and health care implementations?"
        }        
        , 
        {
          "content": "We still have to understand all of it!"
        }        
        , 
        {
          "content": "How are we going to do this if we don't master coding based software development?"
        }        
        , 
        {
          "content": "Let me ask to the experts: How did you get to your status? By seeing code or by coding and coding and coding?"
        }        
        , 
        {
          "content": "That's why I think that the future of the industry is standardization, testing, reviewing, and mainstream modern coding mastering."
        }        
        , 
        {
          "content": "AI can generate all the code we want, but we have to understand all of it, and to do so, we have to master software development trough code."
        }        
        , 
        {
          "content": "Maybe when the Vibe Coding hype discloses it's implications we'll see this more clearly."
        }        
        , 
        {
          "content": "We need a sea of senior developers to review the Tsunami of AI generated software that's coming."
        }        
      ]
    }
  ]
}