{
  "title": "Strong and valuable multitaskers",
  "ideas": [
    {
      "subideas": [
        {
          "content": "REVIT API DEVELOPERS ARE STRONG AND VALUABLE MULTITASKERS. I really meant it. If there's an undervalued discipline, it is AEC Software development. We could present a waterfall of challenges faced by this profession to back this up, but we'll focus on five of the most common and painful ones."
        }
        ,
        {
          "content": "First, many (if not the majority) of us are Architects or Engineers. This means that we transferred to a second craft after our professional training. Learning a new discipline from scratch, and particularly a complex and abstract one as software development, is remarkable. This signals a wide pool of skills and knowledge."
        }
        ,
        {
          "content": "Second, we work with complex and relatively abstract topics. One typical task can be projecting mathematical rays from rooms to openings in order to intersect the representative volume of an open space (this allows us to validate the ventilation of the room to that space). And we do this with less documentation and tools than other areas of software development."
        }
        ,
        {
          "content": "Third, our products can be very abstract for our clients (as hinted in the point above). This requires an enormous trust on their part to maintain a smooth project dynamic and accept required deadline extensions. It's often hard to communicate the complexities of the underlying geometrical and logical processes that we tackle."
        }
        ,
        {
          "content": "Fourth, in many cases, we can't have the luxury of choosing between front, back, or even focused full-stack development. A well-rounded AEC developer must be a hyper-stack. From AWS to the ACC, from web APIs to desktop applications, from Dynamo nodes to Windows installers, from Revit versions to GitHub workflows, from BIM 360 to Visual Studio, from BIM modeling to SQL Databases, and from React frameworks to WPF MVVM UIs, we have a ton to cover."
        }
        ,
        {
          "content": "Fifth, our entry programming language is C# (always coupled with its framework .NET). This is challenging also. Although this is one of the best contemporary languages, it's also relatively complex and relies on somehow abstract industry patterns that move beyond the beginner arena. It's tough to start here."
        }
        ,
        {
          "content": "So the natural question is, why work in this area? It sounds insane!"
        }
        ,
        {
          "content": "And yes, it might very well be crazy choosing this craft. Nonetheless, I think that we love to do it because it's also intellectually rewarding."
        }
        ,
        {
          "content": "It's really challenging and interesting to tackle the fabric of the contemporary AEC industry: DATA (abundant and somehow hidden data)."
        }
        ,
        {
          "content": "For this and many reasons, we must be thankful to God for our craft and communicate as best as we can the value that we bring to the AEC Industry."
        }
        ,
        {
          "content": "AEC developers are strong multitasking professionals bringing enormous value to a multiplatform and data-driven changing industry."
        }
      ]
    }
  ]
}